{"stories":[
    {"key":"001", "storyName":"Store Location Detection", "storyDetails":"As a user, I can view content based on my nearest location, so that I can browse deals closest to me.", "acceptanceCriteria":"Verify that the user’s location is automatically determined by IP lookup or HTML 5 Geo API and the closest store for my location is selected.\n\nDemonstrate the user will return to the same store upon return visits.\n\nDemonstrate that if the user manually selects a store, they’re brought back to that store when returning to the site.\n\nValidate the store's location is displayed according to the design template for a SmartCircular 5 site.\n\n\tShow me a link to change location", "limits":"Users can only be brought back to their manually-selected store location if cookies are enabled in their web browser."},

    {"key":"002", "storyName":"New User Entry Page", "storyDetails":"As a user, if my location cannot be determined by IP lookup services, I can input a zip code or city/state combination so I can browse deals based on my location of choice.", "acceptanceCriteria":"Demonstrate if my location cannot be determined by IP lookup or HTML5 Geo API, I am prompted to enter my zip code or city, state combination.\n\nDemonstrate that if an invalid zip code or city, state combination is entered a user friendly error message is displayed.\n\nValidate set focus, where the cursor is already flashing within the text box.\n\nVerify upon submission, the user is brought to the closest store location based on submitted information.", "limits":""},
    
    {"key":"003", "storyName":"Change Store Location", "storyDetails":"As a user, I can change my store location so I can view deals based on a location of my choice.", "acceptanceCriteria":"Verify the current store location is clearly displayed as per the design template for SmartCircular 5 site.\n\nDemonstrate a user can click on change location as per the design template for SmartCircular 5 site.\n\nDemonstrate a user can change location by entering a new zip code or city, state combination.\n\nVerify that state abbreviations are recognized (ex: IL for Illinois)\n\nShow me a successful entry of a zip code or city, state combination returns a list of the 10 closest stores within 100 miles of the location entered.\n\nVerify the following display for each store:\n\n\tStreet address\n\n\tStreet address\n\n\tCity, state and zip code\n\n\tPhone number (if applicable)\n\n\tStore hours\n\n\tLink to Make my Store\n\n\t\tDemonstrate that clicking on the Make my Store button will return the user to the first page of the ads available for that specific location\n\n\tLink to View in Map\n\n\t\tDemonstrate that clicking on the View in Map button will show the user the google maps available for the selected location.\n\nVerify the following display for the user’s currently selected store:\n\n\tCity, state and zip code\n\n\tMap view\n\nDemonstrate that if an invalid zip code or city, state combination is entered a user friendly error message is displayed.\n\nDemonstrate that if an invalid zip code or city, state combination is entered a user friendly error message is displayed.\n\nShow me a way to leave the change store screen.", "limits":""},

    {"key":"004", "storyName":"Static Header and Footer", "storyDetails":"As a user, I can view a header with a client logo, so I know this site is associated with the client brand.", "acceptanceCriteria":"Verify the logo, is displayed in the header and footer per the SmartCircular 5 design template\n\n\tThe client is responsible for providing the logo to be used in the header and footer.\n\nDemonstrate that clicking the link in the header takes me back to the client's .com site.\n\nShow me the selected store address and store hours are displayed in the footer.\n\n\tShow me a change location option for this store.\n\nVerify the copyright for Shoplocal is displayed in the footer of the SmartCircular 5 site.\n\nShow me a link to the Shoplocal privacy policy in the footer of the SmartCircular 5 site.", "limits":"On tablet and mobile, Shoplocal will build a simple header and footer that includes the client logo for mobile & tablet"},

    {"key":"005", "storyName":"Landing Page", "storyDetails":"As a user, I can see any available content on a landing page, so that I may be able to choose specific content to browse.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nShow me a header and footer with client logo\n\nShow me a way to view additional ads (if available).\n\nShow me a way to link to client.com\n\nShow me how users can access content by page, product view, or keyword search from the landing page.\n\nShow me how users can access their favorites list from the landing page.\n\nShow me my selected location is displayed, and I can change my selected location from the landing page.\n\nShow me up to four available promotions are displayed in the default view\n\n\t Verify that if more than 4 promotions are available, a View All selection is displayed\n\n\tDemonstrate that any additional promotions are accessed by clicking View all\n\nShow me the following details for each promotion:\n\n\tPromotion title\n\n\tPromotion valid dates\n\n\tPromotion cover image\n\n\tCall-to-action for browsing\n\nVerify clicking on the promotion’s title or image brings the user to page one of the selected promotion.\n\n\tValidate that Shoplocal operations can control the display order of promotions.", "limits":"The display order can be determined by client outlined preferences within the promotion schedule"},

    {"key":"006", "storyName":"No Content Display", "storyDetails":"As a user, I can see messaging when there is no content available for my store so the experience is intuitive.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nShow me a message when there is no content available at the user’s selected location.\n\nShow me a link to browse client.com", "limits":""},

    {"key":"007", "storyName":"Browse by Page", "storyDetails":"As a user, I can browse promotion pages so that I may view content for my selected store location in a familiar manner.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nShow me the ability to navigate page content for my selected store.\n\n\tValidate that the user can browse a single page or two pages side by side.\n\n\tShow me a way to toggle between single and two page mode\n\n\tVerify that single page is default.\n\nShow me a way to navigate to the next or previous page\n\nValidate the promotion title, start and end dates are prominently displayed throughout the page browsing experience.\n\nShow me a way to jump to specific page within the promotion.", "limits":"Mobile\n\nShow me content is displayed using a mobile version of SmartCircular 5 design template\n\nVerify only listings per page are shown on mobile, and no page images are displayed.\n\nTablet\n\nShow me gesture-based navigation is used on tablet to enable the user to browse promotions by page.\n\nShow me gesture-based pinching is used on tablet to zoom in and out on a promotion page. "},

    {"key":"008", "storyName":"Browse by Page – Item Preview", "storyDetails":"As a desktop user, I can preview item details by rolling over them with my mouse so that I may see information about the item without leaving the page.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nDemonstrate that the preview is displayed on the page when a clickable item has been rolled over using the mouse \n\n\tShow me the following information is displayed in the item preview:\n\n\t\tImage\n\n\t\tTitle\n\n\t\tPrice\n\n\t\tCall to Action (CTA)\n\n\tVerify clicking on the CTA for an item listing opens that item’s detail page.\n\n\tVerify clicking on a preview for a non-listing opens to a predetermined URL in a new tab or window\n\n\t\tclient is responsible for providing the click-thru URL for any non-listing hotspots", "limits":"Item preview will not be available on mobile or tablet platforms."},
   
    {"key":"009", "storyName":"Item Detail Page", "storyDetails":"As a user, I can see the available details about an item so that I may learn more information about the item.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nShow me a user can access an item detail page from browse by page, product and search views.\n\nShow me the following content is displayed on the item detail page, if available:\n\n\tTitle\n\n\tImage\n\n\tDeal description\n\n\tRegular price\n\n\tPrice qualifier\n\n\tSales description\n\n\tAdditional deal description\n\n\tFine print\n\n\tValid dates\n\n\tAbility to Buy Online\n\n\tLink to View larger image\n\n\tShare item via email\n\n\tShare item via social networks\n\n\t\tLike on Facebook\n\n\t\t+1 on Google Plus\n\n\t\tPin It on Pinterest\n\n\t\tTweet on Twitter\n\nShow me a scroll bar appears when the amount of content exceeds the available space.\n\nShow me a way to close the item detail page.", "limits":""},

    {"key":"010", "storyName":"Browse by Product", "storyDetails":"As a user, I can browse products by category so I may easily view items that are specific to my interests.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nDemonstrate the ability to filter item listings by <client> provided categories.\n\nShow me a list of available categories as determined by the content that is currently active for the store location\n\nDemonstrate that selecting a category returns only item listings that have been designated to that category \n\nDemonstrate the ability to sort category item listings by:\n\n\tPopularity (Default)\n\n\tPrice (Low to high)\n\nShow me a way to navigate up and down through the item listings.\n\nShow me the following information displays for all results, if available:\n\n\tTitle\n\n\tThumbnail image\n\n\tPrice\n\n\tLink to view item details\n\nShow me that clicking on the thumbnail image of an item listing opens that item’s detail page.", "limits":""},
    
    {"key":"011", "storyName":"Keyword Search", "storyDetails":"As a user, I can search active content by keyword(s) so that I may quickly find specific items of interest.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nShow me a field where I can enter keywords to search\n\nShow me default text within the field denoting it is capable of search\n\n\tDemonstrate that when an invalid search term is entered, the null search page is displayed\n\nVerify these data fields are searched with each query:\n\n\tSKU\n\n\tTitle\n\n\tSales Description\n\nShow me that upon a successful keyword search a results page is displayed with my search term and item listings based on my keyword(s)\n\nShow me a way to navigate up and down through the results.\n\nDemonstrate the ability to sort results by:\n\n\tPopularity (default)\n\n\tPrice (low to high)\n\nShow me the following information displays for all results, if available:\n\n\tTitle\n\n\tThumbnail image\n\n\tPrice\n\n\tLink to view item details\n\nShow me that clicking on the thumbnail image of an item listing opens that item’s detail page.\n\nShow me a way to get back to the landing page.", "limits":""},
    
    {"key":"012", "storyName":"Keyword Search – Null Results", "storyDetails":"As a user, when my searched keywords have null results, I am presented with browsing options so that I may find items of interest more intuitively.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nVerify a user friendly message is displayed to indicate no results found.\n\nVerify that the user has the ability to conduct another keyword search\n\nShow me a link to search the client's .com site\n\nShow me a way to get back to the landing page", "limits":""},
    
    {"key":"013", "storyName":"Email Sharing", "storyDetails":"As a user, I can email an item of interest or the Favorites list, so that I may share an electronic copy with others.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nDemonstrate a way to share an individual item via email.\n\nShow me that email is shown as from the client\n\nShow me that the subject line is static and mentions the item title\n\nValidate that the item’s store location and sale dates are stated within the email\n\nVerify that the item’s image, title, price, price qualifier and details are displayed in the email\n\nShow me that clicking on the item from the email will link me to the item detail page within the SmartCircular 5 site.\n\nShow me a way to share the favorites list via email.\n\nShow me that email is shown as from the client\n\nShow me that the subject line is static and references the favorites list\n\nValidate that the item’s store location and sale dates are stated within the email\n\nVerify that the item’s image, title, price, and price qualifier are displayed in the email\n\nShow me that clicking on an item in the favorites list from the email will link me to the item detail page within the SmartCircular 5 site.\n\nVerify user can enter one or more email addresses in the text box.\n\nDemonstrate a notification is displayed upon successful sending of email.\n\nDemonstrate an error message is displayed if email syntax is not correct. ", "limits":"Shoplocal cannot fully guarantee delivery of emails to the recipient, as the recipient’s email preferences and spam filters can vary."},
       
    {"key":"014", "storyName":"Buy Online Linking", "storyDetails":"As a user, I can link to an item of interest from the SmartCircular 5 site to an ecommerce site, so that I can purchase the item online.", "acceptanceCriteria":"Verify the style, copy and layout conforms to the SmartCircular 5 design template.\n\nShow me that items which are enabled for online purchase are displaying a link to buy online\n\n\tThe client has the option of providing a template URL, or establishing a feed to determine which items within SmartCircular 5 should be enabled for online purchase\n\n\tValidate that each URL is matched to a unique product identifier.\n\nDemonstrate that selecting the buy online option links the user to a corresponding item detail page on client's .com in a new browser tab.", "limits":"The client is responsible for ensuring all links provided to Shoplocal function as expected."},
    
    {"key":"015", "storyName":"Social Sharing", "storyDetails":"As a user, I can share an item of interest, so that I can endorse deals in my different social profiles.", "acceptanceCriteria":"Demonstrate selecting to share an item on Facebook shares the deal on the users profile\n\n\tValidate clicking on the shared item brings the user back to the item detail page.\n\nDemonstrate selecting to share an item on Twitter shares the deal on the users profile\n\n\tValidate clicking on the shared item brings the user back to the item detail page.\n\nDemonstrate selecting to share an item on Google+ shares the deal on the users profile\n\n\tValidate clicking on the shared item brings the user back to the item detail page.\n\nDemonstrate selecting to share an item on Pinterest shares the deal on the users profile\n\n\tValidate clicking on the shared item brings the user back to the item detail page.\n\nVerify Social Sharing is available on desktop, mobile and tablet experiences.", "limits":"Shoplocal will make every effort to ensure the site is optimized for these social sites, however if any of these 3rd party social providers should make a breaking change, the fix may require time and research to implement."},
    
    {"key":"016", "storyName":"Search Engine Optimization", "storyDetails":"As a developer I am able to optimize the site code to allow for search engines to easily access relevant information that can assist in the returning of search results.", "acceptanceCriteria":"Validate that the SmartCircular 5 site is optimized in the following areas:\n\n\tPage Title\n\n\tMeta Tags\n\n\tAlt Tags\n\nValidate that the landing page is able to be indexed by search engines\n\nValidate that category pages are able to be indexed by search engines\n\nValidate content is indexed by search engines for individual stores.", "limits":""},
    
    {"key":"017", "storyName":"Tablet Site Optimization", "storyDetails":"As a user, I can browse content on my tablet, so that I may have a consistent and familiar browsing experience that is optimized for my device.", "acceptanceCriteria":"Verify the tablet experience conforms to the SmartCircular 5 design template.\n\nVerify the tablet experience features a tablet-optimized design, and matches the desktop design whenever possible, for a consistent user experience.\n\nShow me the tablet experience matches the desktop functionality except where noted.\n\nShow me the tablet experience will enable the use of gestures to move ahead pages, and pinch and zoom on the pages themselves.", "limits":""},
    
    {"key":"018", "storyName":"Mobile Site Optimization", "storyDetails":"As a user, I can browse content on my smartphone, so that I may have a consistent and familiar browsing experience that is optimized for my device.", "acceptanceCriteria":"Verify the mobile experience conforms to the SmartCircular 5 design template.\n\nShow me the mobile experience matches the desktop functionality except where noted.\n\nVerify the mobile experience features a mobile-optimized design, and matches the desktop design whenever possible, for a consistent user experience.", "limits":""},
    
    {"key":"019", "storyName":"Deep Linking", "storyDetails":"As a marketer, I can link users to specific pages within the SmartCircular 5 site, so that I may drive traffic to specific content based on my goals.", "acceptanceCriteria":"Validate a user can deep link into the following content types, including a combination (when valid):\n\n\tSpecific Store Locations\n\n\tSpecific Promotion\n\n\tSpecific Promotion Page\n\n\tSpecific Item detail\n\n\tSpecific Categories\n\nValidate that upon following any deep link, a user will be shown content for their current store location, unless a specific location is defined within the deep link.\n\nDemonstrate that if a user follows a deep link that is no longer valid, a user-friendly message is displayed stating that the content has expired.\n\n\tShow me a prompt to view the current content for their store. \n\nShow me a deep link can be tracked through WebTrends by appending AdRef=value.\n\n\tClient or third parties can use a unique label for the value in the AdRef to identify unique traffic.\n\n\tTracking results from any inbound link with an AdRef tag will be available under the campaign report in WebTrends.", "limits":"Should a URL use an AdRef tag that is not directing to a Shoplocal hosted property, the traffic will not be counted in the WebTrends reporting."},
    
    {"key":"020", "storyName":"WebTrends Tracking and Analytics ", "storyDetails":"As an analyst, I can track site visits and interactions on the SmartCircular 5 site, so that I may report on how the site is performing.", "acceptanceCriteria":"Validate all reporting is accessible through WebTrends analytics tools.\n\nVerify all SmartCircular 5 data is captured in WebTrends in a unique profile.\n\nThe following reports will be available by platform (mobile, tablet, desktop):\n\n\tActivity per a specific time period\n\n\tOverall visits\n\n\tReturn visits vs. new visitors\n\n\tReferrer\n\n\tGeographical information\n\n\tAction tracking \n\n\tCircular interactions\n\n\tCampaign reporting", "limits":"Webtrends is a 3rd party analytics provider; Shoplocal does not manage the Webtrends reporting interface"},

    {"key":"021", "storyName":"Custom Story", "storyDetails":"As a user, I can...", "acceptanceCriteria":"", "limits":""}

]}